### Terraform Plan - `dev` Environment

#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.medic will be created
  + resource "helm_release" "medic" {
      + atomic                     = true
      + chart                      = "../../../helm/medic"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "medic"
      + namespace                  = "medic"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + <<-EOT
                "api":
                  "replicaCount": 2
                  "resources":
                    "limits":
                      "cpu": "500m"
                      "memory": "512Mi"
                    "requests":
                      "cpu": "100m"
                      "memory": "256Mi"
                "config":
                  "DB_HOST": "medic-dev.ceqlgvbcnid0.us-east-1.rds.amazonaws.com"
                  "DB_NAME": "medic"
                  "DB_PORT": "5432"
                  "LOG_LEVEL": "INFO"
                  "MEDIC_ENVIRONMENT": "dev"
                  "MEDIC_RATE_LIMITER_TYPE": "redis"
                  "OTEL_EXPORTER_OTLP_ENDPOINT": "http://alloy.observability.svc.cluster.local:4317"
                  "OTEL_SERVICE_NAME": "medic"
                  "PG_USER": "medic"
                  "PORT": "8080"
                  "REDIS_URL": "redis://medic-dev.yiyqam.0001.use1.cache.amazonaws.com:6379"
                "externalSecret":
                  "enabled": true
                  "keys":
                  - "remoteRef":
                      "key": "medic/dev/secrets"
                      "property": "MEDIC_SECRETS_KEY"
                    "secretKey": "MEDIC_SECRETS_KEY"
                  - "remoteRef":
                      "key": "medic/dev/secrets"
                      "property": "MEDIC_WEBHOOK_SECRET"
                    "secretKey": "MEDIC_WEBHOOK_SECRET"
                  - "remoteRef":
                      "key": "medic/dev/secrets"
                      "property": "SLACK_API_TOKEN"
                    "secretKey": "SLACK_API_TOKEN"
                  - "remoteRef":
                      "key": "medic/dev/secrets"
                      "property": "SLACK_CHANNEL_ID"
                    "secretKey": "SLACK_CHANNEL_ID"
                  - "remoteRef":
                      "key": "medic/dev/secrets"
                      "property": "SLACK_SIGNING_SECRET"
                    "secretKey": "SLACK_SIGNING_SECRET"
                  - "remoteRef":
                      "key": "medic/dev/secrets"
                      "property": "PAGERDUTY_ROUTING_KEY"
                    "secretKey": "PAGERDUTY_ROUTING_KEY"
                  - "remoteRef":
                      "key": "medic/dev/rds-credentials"
                      "property": "password"
                    "secretKey": "PG_PASS"
                  "secretStoreRef":
                    "kind": "ClusterSecretStore"
                    "name": "aws-secrets-manager"
                "global":
                  "environment": "dev"
                "grafana":
                  "dashboard":
                    "enabled": true
                "image":
                  "pullPolicy": "IfNotPresent"
                  "repository": "018143940435.dkr.ecr.us-east-1.amazonaws.com/medic"
                  "tag": "07ac4a6"
                "ingress":
                  "enabled": true
                  "host": "dev-medic.linqapp.com"
                  "tls":
                    "certificateArn": "arn:aws:acm:us-east-1:018143940435:certificate/afa98678-9022-4e55-81a9-b9f711ea22ce"
                    "enabled": true
                "metrics":
                  "serviceMonitor":
                    "enabled": true
                "migrations":
                  "enabled": true
                "secret":
                  "create": false
                "serviceAccount":
                  "annotations":
                    "eks.amazonaws.com/role-arn": "arn:aws:iam::018143940435:role/medic-dev-secrets-role"
                  "create": true
                  "name": "medic"
                "ui":
                  "enabled": true
                  "image":
                    "repository": "018143940435.dkr.ecr.us-east-1.amazonaws.com/medic-ui"
                    "tag": "07ac4a6"
                  "replicaCount": 2
                "worker":
                  "replicaCount": 1
                  "resources":
                    "limits":
                      "cpu": "200m"
                      "memory": "256Mi"
                    "requests":
                      "cpu": "50m"
                      "memory": "128Mi"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = true
    }

  # module.secrets.aws_iam_policy.secrets_access will be created
  + resource "aws_iam_policy" "secrets_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy allowing Medic to read secrets from Secrets Manager"
      + id               = (known after apply)
      + name             = "medic-dev-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-1:018143940435:secret:medic/dev/secrets-gGZX4v",
                          + "arn:aws:secretsmanager:us-east-1:018143940435:secret:medic/dev/secrets-gGZX4v:*",
                        ]
                      + Sid      = "GetSecretValue"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ListSecrets",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "secretsmanager:ResourceTag/Environment" = "dev"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ListSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "medic-dev-secrets-policy"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-secrets-policy"
          + "Project"     = "medic"
        }
    }

  # module.secrets.aws_iam_role_policy_attachment.secrets_access will be created
  + resource "aws_iam_role_policy_attachment" "secrets_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "medic-dev-secrets-role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @unorig-username, Action: `pull_request`*
*Workflow: `Terraform`*